Revit 2026 API

# ApplicationNewElementSet Method

---

Creates a new instance of a set specifically for holding elements.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementSet NewElementSet()
```
```vb
Public Function NewElementSet As ElementSet
```
```cpp
public:
ElementSet^ NewElementSet()
```
```fsharp
member NewElementSet : unit -> ElementSet
```

#### Return Value

ElementSetA new Element Set.

This is a general purpose set for passing elements to and from methods.

#### Reference

Application Class

Autodesk.Revit.Creation Namespace